Последние дней 10 работал. Едва ли это имеет отношение к практике, однако время занимало 24/7, поэтому вот короткий отчет:
http://spbph.ru/14_02_19 (пароль 12345)
http://spbph.ru/15_02_19
http://spbph.ru/16_02_19
http://spbph.ru/17_02_19
http://spbph.ru/18_02_19
http://spbph.ru/19_02_19
http://spbph.ru/21_02_19
http://spbph.ru/22_02_19
http://spbph.ru/24_02_19

Прошлая версия сайта, к слову, написана собственноручно и всё ещё лежит на локалхосте, но по объективны причинам уступила
конструктору за 5 тысяч в год. Вывод - не изобретай велосипед.
